Movements: ['Stolpern', 'Gehen', 'Stehen']
Learning Rate: 0.003
Number of Epochs: 7000
Batch_size: 1000

Model Summary: 
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 256)                     384256      
________________________________________________________________________________
dense_1 (Dense)                     (None, 128)                     32896       
________________________________________________________________________________
dense_2 (Dense)                     (None, 64)                      8256        
________________________________________________________________________________
dense_3 (Dense)                     (None, 3)                       195         
================================================================================
Total params: 425,603
Trainable params: 425,603
Non-trainable params: 0
________________________________________________________________________________